OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_display.c
// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include "oepl_display.h"
#include "oepl_nvm.h"
#include "oepl_radio.h"
#include "oepl-definitions.h"
#include "oepl_drawing_capi.h"

#if __has_include("oepl_display_driver_custom.h")
   #include "oepl_display_driver_custom.h"
#else
   #include "oepl_display_driver_memlcd.h"
   #include "oepl_display_driver_IL91874.h"
   #include "oepl_display_driver_unissd.h"
   #include "oepl_display_driver_dualssd.h"
   #include "oepl_display_driver_uc8179.h"
   #include "oepl_display_driver_uc8159.h"
   #include "oepl_display_driver_ucvar026.h"
   #include "oepl_display_driver_ucvar029.h"
   #include "oepl_display_driver_ucvar043.h"
   #include "oepl_display_driver_ucbwry.h"
   #include "oepl_display_driver_jd.h"
   #include "oepl_display_driver_interleaved.h"
   #include "oepl_display_driver_GDEW0583Z83.h"
#endif

#include "fonts/fonts.h"
#include "common/bitmaps.h"

#include <stdio.h>
#include <string.h>
#include "oepl_efr32_hwtypes.h"
#include "oepl_hw_abstraction.h"
#include "sl_power_manager.h"

// -----------------------------------------------------------------------------
//                              Configuration values
// -----------------------------------------------------------------------------
#ifndef DISPLAY_DEBUG_PRINT
#define DISPLAY_DEBUG_PRINT 1
#endif

// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#if DISPLAY_DEBUG_PRINT
#define DPRINTF(fmt_, ...) oepl_hw_debugprint(DBG_DISPLAY, (fmt_), ##__VA_ARGS__)
#else
#define DPRINTF(...)
#endif

#define OVERLAY_FLAG_NOT_CONNECTED  (1 << 0)
#define OVERLAY_FLAG_LOW_BATTERY    (1 << 1)

typedef struct {
  union {
    struct {
      uint64_t image_hash;
      uint32_t image_size;
      int image_idx;
    } image;
    oepl_display_infoscreen_t infoscreen;
  };
  bool is_infoscreen;
  uint32_t overlay_flags;
} display_state_t;

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static void add_overlays(uint32_t overlay_mask);
static void add_rendered_content_splash(void);
static void add_rendered_content_ap_found(void);
static void add_rendered_content_ap_not_found(void);
static void add_rendered_content_deepsleep(void);
static void add_rendered_content_fwu(void);

// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
static display_state_t current_state;
static uint32_t requested_overlay_flags;
static size_t xres, yres, num_colors;
static bool is_drawing = false;

// Todo: Log the next to-be-displayed content when async display is implemented

static const oepl_display_driver_desc_t* driver = NULL;

#if __has_include("oepl_display_custom.inl")
#include "oepl_display_custom.inl"
#endif

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------
void oepl_display_init(oepl_efr32xg22_displayparams_t* driverconfig)
{
#if __has_include("oepl_display_driver_custom.h")
   driver = &oepl_display_driver_custom;
#else
  switch(driverconfig->ctrl) {
    case CTRL_MEMLCD:
      driver = &oepl_display_driver_memlcd;
      break;
    case CTRL_IL91874:
      driver = &oepl_display_driver_IL91874;
      break;
    case CTRL_SSD:
      driver = &oepl_display_driver_unissd;
      break;
    case CTRL_UC8179:
      driver = &oepl_display_driver_uc8179;
      break;
    case CTRL_UC8159:
      driver = &oepl_display_driver_uc8159;
      break;
    case CTRL_UCBWRY:
      driver = &oepl_display_driver_ucbwry;
      break;
    case CTRL_JD:
      driver = &oepl_display_driver_jd;
      break;
    case CTRL_INTERLEAVED:
      driver = &oepl_display_driver_interleaved;
      break;
    case CTRL_DUALSSD:
      driver = &oepl_display_driver_dualssd;
      break;
    case CTRL_EPDVAR26:
      driver = &oepl_display_driver_ucvar026;
      break;
    case CTRL_EPDVAR29:
      driver = &oepl_display_driver_ucvar029;
      break;
    case CTRL_EPDVAR43:
      driver = &oepl_display_driver_ucvar043;
      break;
    case CTRL_GDEW0583Z83:
      driver = &oepl_display_driver_gdew0583z83;
      break;
    default:
      oepl_hw_crash(DBG_DISPLAY, false, "Error: Lacking display driver implementation\n");
      return;
  }
#endif

  oepl_display_parameters_t displayparams = {
    .x_res = driverconfig->xres,
    .y_res = driverconfig->yres,
    .x_offset = driverconfig->xoffset,
    .y_offset = driverconfig->yoffset,
    .x_res_effective = driverconfig->xres_working,
    .y_res_effective = driverconfig->yres_working,
    .num_colors = driverconfig->have_fourthcolor ? 4 : driverconfig->have_thirdcolor ? 3 : 2,
    .swapXY = driverconfig->swapXY,
    .mirrorH = driverconfig->mirrorX,
    .mirrorV = driverconfig->mirrorY
  };

  xres = displayparams.x_res;
  yres = displayparams.y_res;
  num_colors = displayparams.num_colors;
  requested_overlay_flags = 0;

  driver->init(&displayparams);
  C_setDisplayParameters(driverconfig->swapXY, driverconfig->xres_working, driverconfig->yres_working);

  current_state.is_infoscreen = false;
  current_state.image.image_hash = 0;
  current_state.image.image_size = 0;
  current_state.image.image_idx = -1;
  current_state.overlay_flags = 0;
}

void oepl_display_show_image(size_t img_idx)
{
  oepl_stored_image_hdr_t img_meta;
  uint32_t img_addr;
  oepl_nvm_status_t nvm_status = oepl_nvm_read_image_metadata(img_idx, &img_meta);
  if(nvm_status != NVM_SUCCESS) {
    DPRINTF("NVM metadata error during display update\n");
    return;
  }

