OpenEPaperLink/Tag_FW_EFR32xG22/firmware/oepl_display.c
  if(!current_state.is_infoscreen &&
     img_meta.md5 == current_state.image.image_hash &&
     img_meta.size == current_state.image.image_size &&
     requested_overlay_flags == current_state.overlay_flags) {
    DPRINTF("Requested image and overlays are already on screen\n");
    return;
  }

  if(!img_meta.is_valid) {
    DPRINTF("Image was not marked valid\n");
    return;
  }

  nvm_status = oepl_nvm_get_image_raw_address(img_idx, &img_addr);
  if(nvm_status != NVM_SUCCESS) {
    DPRINTF("Couldn't get image address\n");
    return;
  }

  C_flushDrawItems();
  C_drawFlashFullscreenImageWithType(img_addr, img_meta.image_format, img_meta.size);
  add_overlays(requested_overlay_flags);

  DPRINTF("Showing image in slot %d\n", img_idx);

  is_drawing = true;
  driver->draw();
  is_drawing = false;
  current_state.image.image_hash = img_meta.md5;
  current_state.image.image_size = img_meta.size;
  current_state.image.image_idx = img_idx;
  current_state.overlay_flags = requested_overlay_flags;
  current_state.is_infoscreen = false;
}

void oepl_display_show_infoscreen(oepl_display_infoscreen_t screen)
{
  if(current_state.is_infoscreen &&
     current_state.infoscreen == screen &&
     requested_overlay_flags == current_state.overlay_flags) {
    // Already displaying this content
    DPRINTF("Already displaying this info screen\n");
    return;
  }

  // Find out if we have a stored image for this info screen
  uint8_t imgtype;
  switch(screen) {
    case INFOSCREEN_DEEPSLEEP:
      imgtype = CUSTOM_IMAGE_LONGTERMSLEEP;
      break;
    case INFOSCREEN_BOOT:
      imgtype = CUSTOM_IMAGE_SPLASHSCREEN;
      break;
    case INFOSCREEN_BOOT_FOUND_AP:
      imgtype = CUSTOM_IMAGE_APFOUND;
      break;
    case INFOSCREEN_LONG_SCAN:
      imgtype = CUSTOM_IMAGE_NOAPFOUND;
      break;
    case INFOSCREEN_LOST_CONNECTION:
      imgtype = CUSTOM_IMAGE_LOST_CONNECTION;
      break;
    case INFOSCREEN_FWU:
      imgtype = 0xFF;
      break;
    case INFOSCREEN_WAKEUP_BUTTON1:
      imgtype = CUSTOM_IMAGE_BUTTON1;
      break;
    case INFOSCREEN_WAKEUP_BUTTON2:
      imgtype = CUSTOM_IMAGE_BUTTON2;
      break;
    case INFOSCREEN_WAKEUP_GPIO:
      imgtype = CUSTOM_IMAGE_GPIO;
      break;
    case INFOSCREEN_WAKEUP_NFC:
      imgtype = CUSTOM_IMAGE_NFC_WAKE;
      break;
    case INFOSCREEN_WAKEUP_RFWAKE:
      imgtype = CUSTOM_IMAGE_RF_WAKE;
      break;
  }

  size_t override_imgidx, img_size;
  DPRINTF("Checking for image ID 0x%x\n", imgtype);
  if(oepl_nvm_get_image_by_type(imgtype, &override_imgidx, &img_size) == NVM_SUCCESS) {
    DPRINTF("Found at idx 0x%x\n", override_imgidx);
    oepl_display_show_image(override_imgidx);
    return;
  }

  DPRINTF("Not found, reverting to rendering\n");
  // Fell through, create our own screen
  C_flushDrawItems();

  switch(screen) {
    case INFOSCREEN_DEEPSLEEP:
      add_rendered_content_deepsleep();
      break;
    case INFOSCREEN_BOOT:
      add_rendered_content_splash();
      break;
    case INFOSCREEN_BOOT_FOUND_AP:
      add_rendered_content_ap_found();
      break;
    case INFOSCREEN_LONG_SCAN:
      add_rendered_content_ap_not_found();
      break;
    case INFOSCREEN_LOST_CONNECTION:
      add_rendered_content_ap_not_found();
      break;
    case INFOSCREEN_FWU:
      add_rendered_content_fwu();
      break;
    case INFOSCREEN_WAKEUP_BUTTON1:
      // Fallthrough
    case INFOSCREEN_WAKEUP_BUTTON2:
      // Fallthrough
    case INFOSCREEN_WAKEUP_GPIO:
      // Fallthrough
    case INFOSCREEN_WAKEUP_NFC:
      // Fallthrough
    case INFOSCREEN_WAKEUP_RFWAKE:
      // Wakeup events aren't rendered - they're only shown if a custom image is present
      return;
  }

  add_overlays(requested_overlay_flags);
  is_drawing = true;
  driver->draw();
  is_drawing = false;
  current_state.overlay_flags = requested_overlay_flags;
  current_state.is_infoscreen = true;
  current_state.infoscreen = screen;
}

void oepl_display_set_overlay(oepl_display_overlay_t overlay, bool show)
{
  uint32_t mask = 0;
  uint8_t overlay_enabled = 1;
  switch(overlay) {
    case ICON_NOT_CONNECTED:
      mask = OVERLAY_FLAG_NOT_CONNECTED;
      if(oepl_nvm_setting_get(OEPL_ENABLE_NORF_ICON, &overlay_enabled, sizeof(overlay_enabled)) != NVM_SUCCESS) {
        // Default to showing overlays
        overlay_enabled = 1;
      }
      break;
    case ICON_LOW_BATTERY:
      mask = OVERLAY_FLAG_LOW_BATTERY;
      if(oepl_nvm_setting_get(OEPL_ENABLE_LOWBAT_ICON, &overlay_enabled, sizeof(overlay_enabled)) != NVM_SUCCESS) {
        // Default to showing overlays
        overlay_enabled = 1;
      }
      break;
  }

  DPRINTF("%s overlay mask 0x%08x\n", overlay_enabled > 0 ? show ? "Set" : "Clear" : "Disabled", mask);

  if(show && (overlay_enabled > 0)) {
    requested_overlay_flags |= mask;
  } else {
    requested_overlay_flags &= ~mask;
  }
}

bool oepl_display_is_drawing(void)
{
  return is_drawing;
}

void oepl_display_draw(oepl_display_draw_done_cb_t cb)
{
  // Todo: async display updates
  (void)cb;
  if(current_state.is_infoscreen) {
    oepl_display_show_infoscreen(current_state.infoscreen);
  } else {
    oepl_display_show_image(current_state.image.image_idx);
  }
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
#ifndef HAS_CUSTOM_ADD_OVERLAYS
static void add_overlays(uint32_t overlay_mask)
{
  if(overlay_mask & OVERLAY_FLAG_LOW_BATTERY) {
    C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_BLACK);
    if (num_colors >= 3) {
      C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_RED);
      C_drawRoundedRectangle(xres - 28, yres - 26, 24, 24, COLOR_RED);
    } else {
      C_drawMask(xres - 27, yres - 26, 22, 22, COLOR_BLACK);
      C_drawRoundedRectangle(xres - 28, yres - 26, 24, 24, COLOR_BLACK);
    }
    C_addBufferedImage(xres - 24, yres - 19, COLOR_BLACK, ROTATE_0, battery, DRAW_NORMAL);
  }

  if(overlay_mask & OVERLAY_FLAG_NOT_CONNECTED) {
    C_drawMask(xres - 28, 4, 24, 24, COLOR_BLACK);
    if (num_colors >= 3) {
      C_drawMask(xres - 28, 4, 24, 24, COLOR_RED);
      C_drawRoundedRectangle(xres - 28, 4, 24, 24, COLOR_RED);
      C_addBufferedImage(xres - 24, 8, COLOR_BLACK, ROTATE_0, ant, DRAW_NORMAL);
      C_addBufferedImage(xres - 16, 15, COLOR_RED, ROTATE_0, cross, DRAW_NORMAL);
    } else {
      C_drawRoundedRectangle(xres - 28, 4, 24, 24, COLOR_BLACK);
      C_addBufferedImage(xres - 24, 8, COLOR_BLACK, ROTATE_0, ant, DRAW_NORMAL);
      C_addBufferedImage(xres - 16, 15, COLOR_BLACK, ROTATE_0, cross, DRAW_NORMAL);
    }
  }
}
#endif

#ifndef HAS_CUSTOM_CONTENT_SPLASH
static void add_rendered_content_splash(void)
{
  uint8_t hwid = oepl_hw_get_hwid();
  uint8_t mac[8];
  oepl_radio_get_mac(mac);
  uint16_t fw = oepl_hw_get_swversion();
  const char* suffix = oepl_hw_get_swsuffix();
  switch (hwid) {
    case SOLUM_M3_PEGHOOK_BWR_13:
      // Fallthrough
    case SOLUM_M3_BWR_16:
    case SOLUM_M3_BWRY_16:
    case SOLUM_M3_BWRY_16_HIGHRES:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      if (hwid == SOLUM_M3_PEGHOOK_BWR_13) {
        C_epdPrintf(2, 38, COLOR_RED, ROTATE_0, "Newton M3 1.3 Peghook\"");
      } else {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 1.6\"");
      }
      if (hwid == SOLUM_M3_BWRY_16 || hwid == SOLUM_M3_BWRY_16_HIGHRES) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(2, yres - 20, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_22:
    case SOLUM_M3_BWRY_22:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.2\"");
      if (hwid == SOLUM_M3_BWRY_22) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_22_LITE:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.2\" LITE");
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_26:
    case SOLUM_M3_BWRY_26:
      // Fallthrough
    case SOLUM_M3_BW_26:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_26) {
		  C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.6\"");
      } else if(hwid == SOLUM_M3_BWRY_26) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 BWRY 2.6\"");
        C_epdPrintf(10, 58, COLOR_YELLOW, ROTATE_0, "Yellow");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 2.6 Freezer\"");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_29:
      // Fallthrough
    case SOLUM_M3_BW_29:
    case SOLUM_M3_BWRY_29:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_29) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 2.9\"");
      } else if(hwid == SOLUM_M3_BWRY_29) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 BWRY 2.9\"");
        C_epdPrintf(10, 58, COLOR_YELLOW, ROTATE_0, "Yellow");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 2.9 Freezer\"");
      }
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_42:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(10, 38, 1, ROTATE_0, "Newton M3 4.2\"");
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 120, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_43:
    case SOLUM_M3_BWRY_43:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(7, 7, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      if(hwid == SOLUM_M3_BWRY_43) {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 BWRY 4.3\"");
      } else {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 4.3\"");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 32, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BW_58:
      // Fallthrough
    case SOLUM_M3_BWR_58:
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSans9pt7b);
      if(hwid == SOLUM_M3_BWR_58) {
        C_epdPrintf(10, 38, COLOR_RED, ROTATE_0, "Newton M3 5.85\"");
      } else {
        C_epdPrintf(10, 38, COLOR_BLACK, ROTATE_0, "Newton M3 5.85\" Freezer");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 0, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(5, yres - 20, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addQR(xres - 120, 42, 3, 3, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_60:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(15, 60, 1, ROTATE_0, "Newton M3 6.0\"");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(293, 61, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(40, 120, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_75:
    case SOLUM_M3_BWRY_75:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      if(hwid == SOLUM_M3_BWRY_75) {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 BWRY 7.5\"");
      } else {
        C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 7.5\"");
      }
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 17, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(420, 81, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(100, 160, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    case SOLUM_M3_BWR_97:
      C_epdSetFont(&FreeSansBold24pt7b);
      C_epdPrintf(10, 10, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      C_epdSetFont(&FreeSansBold18pt7b);
      C_epdPrintf(15, 60, COLOR_RED, ROTATE_0, "Newton M3 9.7\"");
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(xres - 37, 310, COLOR_BLACK, ROTATE_270, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(10, yres - 25, COLOR_BLACK, ROTATE_0, "MAC: %02X:%02X:%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      C_addFlashImage(220, 420, COLOR_BLACK, ROTATE_0, newton);
      C_addQR(260, 160, 3, 7, "https://openepaperlink.eu/tag/0/%02X/%02X%02X%02X%02X%02X%02X%02X%02X/", hwid, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], mac[6], mac[7]);
      break;
    default:
      C_epdSetFont(&FreeSans9pt7b);
      C_epdPrintf(2, 2, COLOR_BLACK, ROTATE_0, "OpenEPaperLink");
      if (num_colors >= 3) {
        C_epdPrintf(2, 38, COLOR_RED, ROTATE_0, "EFR32xG22 ID 0x%02X", hwid);
      } else {
        C_epdPrintf(2, 38, COLOR_BLACK, ROTATE_0, "EFR32xG22 ID 0x%02X", hwid);
      }
      if (num_colors >= 4) {
        C_epdPrintf(5, yres - 60, COLOR_YELLOW, ROTATE_0, "BWRY");
      }
      C_epdPrintf(5, yres - 40, COLOR_BLACK, ROTATE_0, "FW: %04X-%s", fw, suffix);
      C_epdPrintf(2, yres - 20, COLOR_BLACK, ROTATE_0, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[5], mac[6], mac[7]);
      break;
  }
}
#endif

#ifndef HAS_CUSTOM_CONTENT_AP_FOUND
static void add_rendered_content_ap_found(void)
{
  int8_t rssi, temperature = -127;
  uint8_t lqi;
  uint8_t APmac[8], mac[8];
  uint8_t currentChannel;
  uint8_t hwid = oepl_hw_get_hwid();
  uint16_t mv = 0;
  bool accentcolor = num_colors >= 3 ? COLOR_RED : COLOR_BLACK;
  size_t vres = xres > yres ? yres : xres;

  if(!oepl_radio_get_ap_link(&currentChannel, APmac, &lqi, &rssi)) {
    rssi = -127;
    lqi = 0;
    currentChannel = 0;
    memset(APmac, 0, sizeof(APmac));
  }

  oepl_hw_get_temperature(&temperature);
  oepl_hw_get_voltage(&mv, false);

  oepl_radio_get_mac(mac);

